Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཤི་འཕོས་ནས་འདིར་སྐྱེས་སོ་ཞེས་རྣམ་པ་དང་བཅས། ཡུལ་ཕྱོགས་དང་བཅས་པར་བདག་དང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་རྗེས་སུ་དྲན་ནོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟ་བུར་སྙོམས་པར་ཞུགས་པའི་སེམས་ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བ། འོད་གསལ་བ། ཉོན་མོངས་པ་མེད་པ། ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བ། མཉེན་པ། ལས་སུ་རུང་བར་གནས་པ། མི་གཡོ་བར་གྱུར་པས་ནམ་གྱི་ཆ་སྨད་སྐྱ་རེངས་འཆར་བའི་དུས་ཀྱི་ཚེ་རྔ་བརྡུང་བའི་ནམ་ཚོད་ཙམ་ན་སྡུག་བསྔལ་དང་། ཀུན་འབྱུང་བ་ནུབ་པར་བྱ་བ་དང་། ཟག་པ་ཟད་པ་ཤེས་པ་མཐོང་བའི་རིག་པ་མངོན་དུ་བྱ་བའི་ཕྱིར་སེམས་མངོན་པར་སྒྲུབ་ཅིང་མངོན་པར་གཏོད་དེ།
en: Then, while his mind—purified and cleansed, lucid, free of basic and subsidiary afflictions, supple, flexible, and immovable—was immersed in this way, during the final station of the night, just at the break of dawn, right at the time of night when the morning drum is beaten, the Bodhisattva produced the intent to actualize the knowledge that brings suffering and its origin to an end and realizes the insight that exhausts defilements, and so he directed his mind to that purpose.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཀྱེ་མ་འཇིག་རྟེན་འདི་ནི་འདི་ལྟ་སྟེ།
en: He thought, “How miserable is this world!

source: སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། འཆི་འཕོ་བ་དང་། སྐྱེ་བས་སྡུག་བསྔལ་བར་གྱུར་པ་ཡིན་ན། འོན་ཀྱང་རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་ལ་སོགས་པའི་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་འདི་ལས་འབྱུང་བར་བྱ་བ་མི་ཤེས་ཏེ།
en: It is anguished by birth, old age, sickness, death, departure, and rebirth, but it does not know how to remove itself from this massive heap of pure anguish, marked foremost by old age, sickness, and death. Alas!

source: ཨེ་མའོ་རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་ལ་སོགས་པ་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་འདི་ཐམས་ཅད་ཟད་པར་བྱ་བར་ཤེས་ན་ཅི་མ་རུང་སྙམ་ནས།
en: If only beings understood how to extinguish this massive heap of pure anguish marked foremost by old age, sickness, and death.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་ཡོད་པས་རྒ་བ་དང་འཆི་བ་བྱུང་།
en: Then the Bodhisattva continued to think, “What is the prerequisite for old age and dying to take place?

source: རྒ་བ་དང་འཆི་བའི་རྐྱེན་ནི་གང་ཡིན་སྙམ་ནས། དེས་འདི་སྙམ་དུ་བསམས་ཏེ། སྐྱེ་བ་ཡོད་པས་རྒ་ཤི་བྱུང་སྟེ།
en: And what is the causal condition of aging and death?” It then occurred to him, “Aging and death happen when there is birth.

source: རྒ་ཤིའི་རྐྱེན་ནི་སྐྱེ་བ་ཡིན་ནོ་སྙམ་མོ།
en: Birth is the causal condition of old age and death.”

source: །དེ་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་ཡོད་པས་སྐྱེ་བ་བྱུང་།
en: Then the Bodhisattva thought again, “What is the prerequisite for birth to take place?

source: སྐྱེ་བའི་རྐྱེན་ནི་གང་ཡིན་སྙམ་ནས། དེས་འདི་སྙམ་དུ་བསམས་ཏེ། སྲིད་པ་ཡོད་པས་སྐྱེ་བ་བྱུང་སྟེ།
en: What is the causal condition of birth?” It then occurred to him, “Birth happens when there is existence.

source: སྐྱེ་བའི་རྐྱེན་ནི་སྲིད་པ་ཡིན་ནོ་སྙམ་མོ།
en: Existence is the causal condition of birth.”

source: །དེ་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་ཡོད་པས་སྲིད་པ་བྱུང་།
en: Then the Bodhisattva wondered, “What is the prerequisite for existence to emerge?

source: སྲིད་པའི་རྐྱེན་ནི་གང་ཡིན་སྙམ་ནས། དེས་འདི་སྙམ་དུ་བསམས་ཏེ། ལེན་པ་ཡོད་པས་སྲིད་པ་བྱུང་སྟེ།
en: What is the causal condition of existence?” It then occurred to the Bodhisattva, “Existence occurs when there is clinging.

source: སྲིད་པའི་རྐྱེན་ནི་ལེན་པ་ཡིན་ནོ་སྙམ་མོ།
en: Clinging is the causal condition of existence.”

source: །དེ་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་ཡོད་པས་ལེན་པ་བྱུང་།
en: Then the Bodhisattva wondered, “What is the prerequisite for clinging to occur?

source: ལེན་པའི་རྐྱེན་ནི་གང་ཡིན་སྙམ་ནས། དེས་འདི་སྙམ་དུ་བསམས་ཏེ། སྲེད་པ་ཡོད་པས་ལེན་པ་བྱུང་སྟེ།
en: What is the causal condition of clinging?” It then occurred to him, “Clinging occurs when there is craving.

source: ལེན་པའི་རྐྱེན་ནི་སྲེད་པ་ཡིན་ནོ་སྙམ་མོ།
en: Craving is the causal condition of clinging.”

source: །དེ་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་ཡོད་པས་སྲེད་པ་བྱུང་།
en: Then the Bodhisattva thought, “What is the prerequisite for craving to take place?

source: སྲེད་པའི་རྐྱེན་ནི་གང་ཡིན་སྙམ་ནས། དེས་འདི་སྙམ་དུ་བསམས་ཏེ། ཚོར་བ་ཡོད་པས་སྲེད་པ་བྱུང་སྟེ།
en: What is the causal condition of craving?” It then occurred to him, “Craving occurs when there is feeling.

source: སྲེད་པའི་རྐྱེན་ནི་ཚོར་བ་ཡིན་ནོ་སྙམ་མོ།
en: Feeling is the causal condition of craving.”

source: །དེ་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་ཡོད་པས་ཚོར་བ་བྱུང་།
en: The Bodhisattva then wondered, “What is the prerequisite for feeling to take place?

source: ཚོར་བའི་རྐྱེན་ནི་གང་ཡིན་སྙམ་ནས། དེས་འདི་སྙམ་དུ་བསམས་ཏེ། རེག་པ་ཡོད་པས་ཚོར་བ་བྱུང་སྟེ།
en: What is the causal condition of feeling?” It then occurred to him, “Feeling happens when there is contact.

source: ཚོར་བའི་རྐྱེན་ནི་རེག་པ་ཡིན་ནོ་སྙམ་མོ།
en: Contact is the causal condition of feeling.”

source: །དེ་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Then the Bodhisattva thought, “What is the prerequisite for contact to occur?

source: གང་ཡོད་པས་རེག་པ་བྱུང་། རེག་པའི་རྐྱེན་ནི་གང་ཡིན་སྙམ་ནས། དེས་འདི་སྙམ་དུ་བསམས་ཏེ། སྐྱེ་མཆེད་དྲུག་ཡོད་པས་རེག་པ་བྱུང་སྟེ།
en: What is the causal condition of contact?” It then occurred to him, “Contact happens when the six sense fields are present.

source: རེག་པའི་རྐྱེན་ནི་སྐྱེ་མཆེད་དྲུག་ཡིན་ནོ་སྙམ་མོ།
en: The six sense fields are the causal condition of contact.”

source: །དེ་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་ཡོད་པས་སྐྱེ་མཆེད་དྲུག་བྱུང་།
en: Then the Bodhisattva wondered, “What is the prerequisite for the six sense fields to emerge?

source: སྐྱེ་མཆེད་དྲུག་གི་རྐྱེན་ནི་གང་ཡིན་སྙམ་ནས། དེས་འདི་སྙམ་དུ་སེམས་ཏེ། མིང་དང་གཟུགས་ཡོད་པས་སྐྱེ་མཆེད་དྲུག་བྱུང་སྟེ།
en: What is the causal condition of the six sense fields?” It then occurred to him, “The six sense fields emerge when there is name and form.

source: སྐྱེ་མཆེད་དྲུག་གི་རྐྱེན་ནི་མིང་དང་གཟུགས་ཡིན་ནོ་སྙམ་མོ།
en: Name and form is the causal condition of the six sense fields.”

source: །དེ་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་ཡོད་པས་མིང་དང་གཟུགས་བྱུང་།
en: The Bodhisattva then thought, “What is the prerequisite for name and form to come into being?

source: མིང་དང་གཟུགས་ཀྱི་རྐྱེན་ནི་གང་ཡིན་སྙམ་ནས། དེས་འདི་སྙམ་དུ་བསམས་ཏེ། རྣམ་པར་ཤེས་པ་ཡོད་པས་མིང་དང་གཟུགས་བྱུང་སྟེ།
en: What is the causal condition of name and form?” It then occurred to him, “Name and form come into being when there is consciousness.

source: མིང་དང་གཟུགས་ཀྱི་རྐྱེན་ནི་རྣམ་པར་ཤེས་པ་ཡིན་ནོ་སྙམ་མོ།
en: Consciousness is the causal condition of name and form.”

source: །དེ་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་ཡོད་པས་རྣམ་པར་ཤེས་པ་བྱུང་།
en: Then the Bodhisattva wondered, “What is the prerequisite for consciousness to form?

source: རྣམ་པར་ཤེས་པའི་རྐྱེན་ནི་གང་ཡིན་སྙམ་ནས། དེས་འདི་སྙམ་དུ་བསམས་ཏེ། འདུ་བྱེད་ཡོད་པས་རྣམ་པར་ཤེས་པ་བྱུང་སྟེ།
en: What is the causal condition of consciousness?” It then occurred to him, “Consciousness emerges when there are formations.

source: རྣམ་པར་ཤེས་པའི་རྐྱེན་ནི་འདུ་བྱེད་ཡིན་ནོ་སྙམ་མོ།
en: Formations are the causal condition of consciousness.”

source: གང་ཡོད་པས་འདུ་བྱེད་བྱུང་། འདུ་བྱེད་ཀྱི་རྐྱེན་ནི་གང་ཡིན་སྙམ་ནས། དེས་འདི་སྙམ་དུ་བསམས་ཏེ། མ་རིག་པ་ཡོད་པས་འདུ་བྱེད་བྱུང་སྟེ།
en: What is the causal condition for formations?” It then occurred to him, “Formations come into being when there is ignorance.

source: འདུ་བྱེད་ཀྱི་རྐྱེན་ནི་མ་རིག་པ་ཡིན་ནོ་སྙམ་མོ།
en: Ignorance is the causal condition of formations.”

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད་རྣམས།
en: Then, monks, the thought occurred to the Bodhisattva, “Ignorance provides the causal condition for formations.

source: འདུ་བྱེད་ཀྱི་རྐྱེན་གྱིས་རྣམ་པར་ཤེས་པ།
en: Formations provide the causal condition for consciousness.

source: རྣམ་པར་ཤེས་པའི་རྐྱེན་གྱིས་མིང་དང་གཟུགས།
en: Consciousness provides the causal condition for name and form.

source: མིང་དང་གཟུགས་ཀྱི་རྐྱེན་གྱིས་སྐྱེ་མཆེད་དྲུག །སྐྱེ་མཆེད་དྲུག་གི་རྐྱེན་གྱིས་རེག་པ།
en: Name and form provides the causal condition for the six sense fields. The six sense fields provide the causal condition for contact.

source: རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ།
en: Contact provides the causal condition for feeling.

source: ཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ།
en: Feeling provides the causal condition for craving.

source: སྲེད་པའི་རྐྱེན་གྱིས་ལེན་པ།
en: Craving provides the causal condition for clinging.

source: ལེན་པའི་རྐྱེན་གྱིས་སྲིད་པ།
en: Clinging provides the causal condition for existence.

source: སྲིད་པའི་རྐྱེན་གྱིས་སྐྱེ་བ།
en: Existence provides the causal condition for birth.

source: སྐྱེ་བའི་རྐྱེན་གྱིས་རྒ་ཤི་དང་མྱ་ངན་དང་སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་འབྱུང་བར་འགྱུར་ཏེ།
en: Birth provides the causal condition for old age and death, lamentation, pain, despair, and torment.

source: དེ་ལྟར་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་འདི་འབྱུང་བར་འགྱུར་རོ་སྙམ་མོ།
en: Such is how this massive heap of pure anguish comes into being.”

source: །དགེ་སློང་དག་སྔོན་མ་ཐོས་པའི་ཆོས་རྣམས་ལ་ཀུན་འབྱུང་ཀུན་འབྱུང་ཞེས་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་ཅིང་མང་དུ་བྱེད་པས་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་སྐྱེས། མིག་སྐྱེས། རིག་པ་སྐྱེས། མང་པོ་ཤེས་པ་སྐྱེས། ཡིད་གཞུངས་པ་སྐྱེས། ཤེས་རབ་སྐྱེས་སོ། །སྣང་བ་བྱུང་ངོ་། །
en: Monks, through considering and ruminating over these factors, which had never before been heard, there dawned in the Bodhisattva wisdom, vision, knowledge, intelligence, prudence, and insight, and a light began to shine.

source: དེ་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་མེད་པས་རྒ་ཤི་མེད་པར་འགྱུར།
en: Then the Bodhisattva thought, “What must be absent for old age and death not to occur?

source: གང་འགགས་པས་རྒ་ཤི་འགག་སྙམ་ནས། དེས་འདི་སྙམ་དུ་བསམས་ཏེ། སྐྱེ་བ་མེད་ན་རྒ་ཤི་མེད་པར་འགྱུར་ཏེ།
en: What must be prevented to eliminate old age and death?” It then occurred to him, “When there is no birth, old age and death do not happen.

source: སྐྱེ་བ་འགགས་པས་རྒ་ཤི་འགག་གོ་སྙམ་མོ།
en: Old age and death are prevented by preventing birth.”

source: །དེ་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་མེད་པས་སྐྱེ་བ་མེད་པར་འགྱུར།
en: Then the Bodhisattva pondered, “What must be absent for birth not to happen?

source: གང་འགགས་པས་སྐྱེ་བ་འགག་སྙམ་ནས། དེས་འདི་སྙམ་དུ་བསམས་ཏེ། སྲིད་པ་མེད་ན་སྐྱེ་བ་མེད་པར་འགྱུར་ཏེ།
en: What must be prevented to eliminate birth?” The thought then occurred to him, “When there is no existence, birth does not take place.

source: སྲིད་པ་འགགས་པས་སྐྱེ་བ་འགག་གོ་སྙམ་མོ།
en: Birth is eliminated by preventing existence.”

source: །དེ་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་མེད་པས་ཞེས་བྱ་བ་ནས་རྒྱས་པར་སྦྱར་ཏེ། འདུ་བྱེད་མེད་པར་འགྱུར།
en: The Bodhisattva then considered, “What must be absent to avoid everything down to formations to manifest?

source: གང་འགགས་པས་འདུ་བྱེད་འགག་སྙམ་པའི་བར་དུའོ། །དེས་འདི་སྙམ་དུ་བསམས་ཏེ། མ་རིག་པ་མེད་པས་འདུ་བྱེད་མེད་པར་འགྱུར་ཏེ།
en: What must be prevented to eliminate formations?” It then occurred to him, “When there is no ignorance, formations do not form.

source: མ་རིག་པ་འགགས་པས་འདུ་བྱེད་འགག་གོ།
en: Preventing ignorance prevents formations.

source: །འདུ་བྱེད་འགགས་པས་རྣམ་པར་ཤེས་པ་འགག་གོ་ཞེས་བྱ་བ་ནས། སྐྱེ་བ་འགགས་པས་རྒ་ཤི་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་འགག་པར་འགྱུར་ཏེ།
en: By preventing formations, consciousness is prevented, and so on, until birth is prevented, thus putting an end to old age and death, anguish, lamentation, pain, despair, and torment.

source: དེ་ལྟར་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་འདི་འགག་པར་འགྱུར་རོ་སྙམ་པའི་བར་དུའོ།
en: Such is how this massive heap of pure anguish is brought to an end.”

source: །དགེ་སློང་དག་དེ་ལྟར་སྔོན་མ་ཐོས་པའི་ཆོས་རྣམས་ལ་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་ཅིང་མང་དུ་བྱེད་པས་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་སྐྱེས། མིག་སྐྱེས། རིག་པ་སྐྱེས། མང་པོ་ཤེས་པ་སྐྱེས། ཡིད་གཞུངས་པ་སྐྱེས། ཤེས་རབ་སྐྱེས་སོ། །སྣང་བ་བྱུང་ངོ་། །དགེ་སློང་དག་ངས་དེའི་ཚེ་འདི་ནི་ཟག་པ་སྡུག་བསྔལ་ལོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་སོ།
en: Monks, through considering and ruminating over these factors that had never before been heard, there dawned in the Bodhisattva wisdom, vision, knowledge, intelligence, prudence, and insight, and a light began to shine. Monks, on that occasion I accurately understood four truths. I understood: (1)

source: །འདི་ནི་ཟག་པའི་ཀུན་འབྱུང་བའོ། །འདི་ནི་ཟག་པ་འགོག་པའོ། །འདི་ནི་ཟག་པ་འགོག་པར་འགྲོ་བའི་ལམ་མོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་སོ།
en: the defiled is suffering, (2) the source of the defiled, (3) how the defiled is brought to cessation, and (4) the path that leads to the cessation of the defiled.

source: །འདི་ནི་འདོད་པའི་ཟག་པའོ། །འདི་ནི་སྲེད་པའི་ཟག་པའོ། །འདི་ནི་མ་རིག་པའི་ཟག་པའོ། །འདི་ནི་ལྟ་བའི་ཟག་པའོ།
en: I accurately understood the defilement of desire, the defilement of craving, the defilement of ignorance, and the defilement of beliefs.

source: །འདིར་ཟག་པ་མ་ལུས་པར་འགག་གོ། །འདིར་ཟག་པ་མ་ལུས་པར་མི་སྣང་བར་འགྱུར་ཞིང་ནུབ་པར་འགྱུར་རོ།
en: I understood where exactly these defilements come to an end without leaving any residue, and where exactly these defilements vanish and disappear without leaving any residue.

source: །འདི་ནི་མ་རིག་པའོ། །འདི་ནི་མ་རིག་པའི་ཀུན་འབྱུང་བའོ། །འདི་ནི་མ་རིག་པ་འགོག་པའོ། །འདི་ནི་མ་རིག་པ་འགོག་པར་འགྲོ་བའི་ལམ་མོ་ཞེས་ཡང་དག་པར་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་སོ།
en: I accurately understood the identity of ignorance, the source of ignorance, the cessation of ignorance, and the path leading to its cessation.

source: །འདིར་མ་རིག་པ་མ་ལུས་པར་མི་སྣང་བར་འགྱུར་ཏེ་ནུབ་པར་འགྱུར་རོ་ཞེས་བྱ་བར་དེ་བཞིན་དུ་སྦྱར་རོ།
en: I understood where exactly all ignorance without exception vanishes and disappears.

source: །འདི་དག་ནི་འདུ་བྱེད་རྣམས་སོ། །འདི་ནི་འདུ་བྱེད་ཀྱི་ཀུན་འབྱུང་བའོ། །འདི་ནི་འདུ་བྱེད་འགོག་པའོ། །འདི་ནི་འདུ་བྱེད་འགོག་པར་འགྲོ་བའི་ལམ་མོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་སོ།
en: And further I accurately understood the precise identity of formations, the source of formations, the cessation of formations, and the path leading to their cessation.

source: །འདི་ནི་རྣམ་པར་ཤེས་པའོ། །འདི་ནི་རྣམ་པར་ཤེས་པའི་ཀུན་འབྱུང་བའོ། །འདི་ནི་རྣམ་པར་ཤེས་པ་འགོག་པའོ། །འདི་ནི་རྣམ་པར་ཤེས་པ་འགོག་པར་འགྲོ་བའི་ལམ་མོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་སོ།
en: I accurately understood the precise identity of consciousness, the source of consciousness, the cessation of consciousness, and the path leading to its cessation.

source: །འདི་ནི་མིང་དང་གཟུགས་སོ། །འདི་ནི་མིང་དང་གཟུགས་ཀྱི་ཀུན་འབྱུང་བའོ། །འདི་ནི་མིང་དང་གཟུགས་འགོག་པའོ། །འདི་ནི་མིང་དང་གཟུགས་འགོག་པར་འགྲོ་བའི་ལམ་མོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་སོ།
en: I accurately understood the precise identity of name and form, the source of name and form, the cessation of name and form, and the path leading to its cessation.

source: །འདི་ནི་སྐྱེ་མཆེད་དྲུག་གོ། །འདི་ནི་སྐྱེ་མཆེད་དྲུག་གི་ཀུན་འབྱུང་བའོ། །འདི་ནི་སྐྱེ་མཆེད་དྲུག་འགོག་པའོ། །འདི་ནི་སྐྱེ་མཆེད་དྲུག་འགོག་པར་འགྲོ་བའི་ལམ་མོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་སོ།
en: I accurately understood the precise identity of the six sense fields, the source of the six sense fields, the cessation of the six sense fields, and the path leading to their cessation.

source: །འདི་ནི་རེག་པའོ། །འདི་ནི་རེག་པའི་ཀུན་འབྱུང་བའོ། །འདི་ནི་རེག་པ་འགོག་པའོ། །འདི་ནི་རེག་པ་འགོག་པར་འགྲོ་བའི་ལམ་མོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་སོ།
en: I accurately understood the precise identity of contact, the source of contact, the cessation of contact, and the path leading to its cessation.

source: །འདི་ནི་ཚོར་བའོ། །འདི་ནི་ཚོར་བའི་ཀུན་འབྱུང་བའོ། །འདི་ནི་ཚོར་བ་འགོག་པའོ། །འདི་ནི་ཚོར་བ་འགོག་པར་འགྲོ་བའི་ལམ་མོ།
en: I accurately understood the precise identity of feeling, the source of feeling, the cessation of feeling, and the path leading to its cessation.

source: །འདི་ནི་སྲེད་པའོ། །འདི་ནི་སྲེད་པའི་ཀུན་འབྱུང་བའོ། །འདི་ནི་སྲེད་པ་འགོག་པའོ། །འདི་ནི་སྲེད་པ་འགོག་པར་འགྲོ་བའི་ལམ་མོ།
en: I accurately understood the precise identity of craving, the source of craving, the cessation of craving, and the path leading to its cessation.

source: །འདི་ནི་ལེན་པའོ། །འདི་ནི་ལེན་པའི་ཀུན་འབྱུང་བའོ། །འདི་ནི་ལེན་པ་འགོག་པའོ། །འདི་ནི་ལེན་པ་འགོག་པར་འགྲོ་བའི་ལམ་མོ།
en: I accurately understood the precise identity of clinging, the source of clinging, the cessation of clinging, and the path leading to its cessation.

source: །འདི་ནི་སྲིད་པའོ། །འདི་ནི་སྲིད་པའི་ཀུན་འབྱུང་བའོ། །འདི་ནི་སྲིད་པ་འགོག་པའོ། །འདི་ནི་སྲིད་པ་འགོག་པར་འགྲོ་བའི་ལམ་མོ།
en: I accurately understood the precise identity of existence, the source of existence, the cessation of existence, and the path leading to its cessation.

source: །འདི་ནི་སྐྱེ་བའོ། །འདི་ནི་སྐྱེ་བའི་ཀུན་འབྱུང་བའོ། །འདི་ནི་སྐྱེ་བ་འགོག་པའོ། །འདི་ནི་སྐྱེ་བ་འགོག་པར་འགྲོ་བའི་ལམ་མོ།
en: I accurately understood the precise identity of birth, the source of birth, the cessation of birth, and the path leading to its cessation.

source: །འདི་ནི་རྒ་བའོ། །འདི་ནི་རྒ་བའི་ཀུན་འབྱུང་བའོ། །འདི་ནི་རྒ་བ་འགོག་པའོ། །འདི་ནི་རྒ་བ་འགོག་པར་འགྲོ་བའི་ལམ་མོ།
en: I accurately understood the precise identity of old age, the source of old age, the cessation of old age, and the path leading to its cessation.

source: །འདི་ནི་འཆི་བའོ། །འདི་ནི་འཆི་བའི་ཀུན་འབྱུང་བའོ། །འདི་ནི་འཆི་བ་འགོག་པའོ། །འདི་ནི་འཆི་བ་འགོག་པར་འགྲོ་བའི་ལམ་མོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་སོ།
en: I accurately understood the precise identity of death, the source of death, the cessation of death, and the path leading to its cessation.

source: །འདི་དག་ནི་མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་ཏེ། དེ་ལྟར་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་འདི་འབྱུང་བར་འགྱུར་བ་ནས། འགོག་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་སོ།
en: I accurately understood precisely how this massive heap of pure suffering, with its anguish, lamentation, pain, despair, and torment comes into being and how it ceases.

source: །འདི་ནི་སྡུག་བསྔལ་ལོ། །འདི་ནི་སྡུག་བསྔལ་གྱི་ཀུན་འབྱུང་བའོ། །འདི་ནི་སྡུག་བསྔལ་འགོག་པའོ། །འདི་ནི་སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་མོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་སོ།
en: I accurately understood the precise identity of suffering, the source of suffering, the cessation of suffering, and the path leading to its cessation.

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔས་ནམ་གྱི་ཆ་སྨད་སྐྱ་རེངས་འཆར་བའི་དུས་ཀྱི་ཚེ་རྔ་བརྡུང་བའི་ནམ་ཚོད་ཙམ་ན་སྐྱེས་བུ་དང་། སྐྱེས་བུ་དམ་པ་དང་། སྐྱེས་བུ་མཆོག་དང་། སྐྱེས་བུ་ཆེན་པོ་དང་། སྐྱེས་བུ་ཁྱུ་མཆོག་དང་། སྐྱེས་བུ་གླང་པོ་དང་། སྐྱེས་བུ་སེང་གེ་དང་། སྐྱེས་བུ་སྐྱེས་མཆོག་དང་། སྐྱེས་བུ་དཔའ་བོ་དང་། སྐྱེས་བུ་རྟུལ་ཕོད་དང་། སྐྱེས་བུ་ཅང་ཤེས་དང་། སྐྱེས་བུ་པད་མ་དང་། སྐྱེས་བུ་པད་མ་དཀར་པོ་དང་། སྐྱེས་བུ་ལྗིད་ཁྱེར་བ་དང་། སྐྱེས་བུ་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པས་འཕགས་པའི་ཡེ་ཤེས་ཀྱིས་ཤེས་པར་བྱ་བ་དང་། ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། ཐོབ་པར་བྱ་བ་དང་། བལྟ་བར་བྱ་བ་དང་། མངོན་དུ་བྱ་བ་གང་ཅི་ཡང་རུང་སྟེ།
en: Thus, monks, sure enough, during the final station of night, just at the break of dawn, right at the time for the beating of the morning drum, the Bodhisattva—the being, the good being, the supreme being, the great being, the ox among men, the elephant among men, the lion among men, the bull among men, the hero among men, the champion among men, the adept among men, the lotus among men, the white lotus among men, the supreme beast of burden among men, the unexcelled charioteer among men—reached unexcelled, perfect and complete awakening, attaining the threefold knowledge.

source: དེ་ཐམས་ཅད་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་རིག་པ་གསུམ་ཐོབ་བོ།
en: He did so through knowledge that consists of one-pointed insight into everything that might be known, understood, attained, realized, and actualized via the wisdom of the noble ones.

source: །དགེ་སློང་དག་དེ་ནས་ལྷའི་བུ་རྣམས་ཀྱིས་སྨྲས་པ། གྲོགས་པོ་དག་བཅོམ་ལྡན་འདས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱིས་མེ་ཏོག་གཏོར་ཅིག་ཅེས་བྱས་སོ།
en: Monks, then the gods said, “Friends, let us scatter flowers! The Blessed One has reached perfect awakening!”

source: །དེ་ནས་ལྷའི་བུ་གང་དག་སྔོན་གྱི་སངས་རྒྱས་མཐོང་བ་དེ་དག་འདུས་ནས་དེ་དག་གིས་དེ་དག་ལ་སྨྲས་པ། གྲོགས་པོ་དག་སྔོན་གྱི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱང་བརྡ་མཛད་ཅིང་བརྡ་མངོན་པར་སྤྲུལ་པ་མཛད་ཀྱིས། བཅོམ་ལྡན་འདས་ཀྱིས་བརྡ་མཛད་ཀྱི་བར་དུ་མེ་ཏོག་མ་གཏོར་ཅིག །
en: But just then, some gods who had seen buddhas before came together and told the others, “Friends, since perfect and complete buddhas of the past all produced and manifested a sign, do not toss flowers until the Blessed One has made a sign.”

source: དགེ་སློང་དག་དེ་ནས་དེ་བཞིན་གཤེགས་པས་ལྷའི་བུ་དེ་དག་ཡིད་གཉིས་སུ་གྱུར་པར་མཁྱེན་ནས། ཤིང་ཏ་ལ་བདུན་ཙམ་དུ་ནམ་མཁའ་ལ་མངོན་པར་འཕགས་ཏེ།
en: Monks, the Thus-Gone One knew that the gods were in doubt, so he ascended into the sky to the height of seven palm trees, and while seated there he uttered this phrase of exultation:

source: དེར་བཞུགས་ནས་ལམ་གྱི་རྒྱུན་ནི་ཆད་དོ།
en: “The path has been interrupted;

source: །རྡུལ་ནི་ཉེ་བར་ཞིའོ།
en: Impurities have been extinguished.

source: །ཟག་པ་ནི་སྐམས་ཏེ་ཡང་མི་ཟག་གོ།
en: The outflows have dried up and flow no longer;

source: །ལམ་ནི་ཆད་དེ་ཡང་མི་འཇུག་གོ།
en: The path, now ended, I travel no longer.

source: །འདི་ནི་སྡུག་བསྔལ་གྱི་མཐའ་ཞེས་བྱའོ་ཞེས་ཆེད་དུ་རྗོད་པ་ཆེད་དུ་བརྗོད་དོ། །དེ་ནས་ལྷའི་བུ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་ལྷའི་མེ་ཏོག་གིས་གཏོར་ཏེ། དེ་ནས་ལྷའི་མེ་ཏོག་པུས་མོ་ནུབ་ཙམ་དུ་བཀྲམ་པར་གྱུར་ཏོ། །
en: This is called the end of suffering!” The gods thus strewed the Thus-Gone One with celestial flowers, piling them up to his knees.

source: དགེ་སློང་དག་དེ་ལྟར་དེ་བཞིན་གཤེགས་པས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། མུན་པ་མུན་ནག་དང་ནི་བྲལ། སྲེད་པ་ནི་རྣམ་པར་སྦྱངས། ལྟ་བ་ནི་བཟློག །ཉོན་མོངས་པ་རྣམས་ནི་རྣམ་པར་དཀྲུགས། ཟུག་རྔུ་ནི་ཕྱུང་། མདུད་པ་ནི་བཀྲོལ། ང་རྒྱལ་གྱི་རྒྱལ་མཚན་ནི་བསྙལ། ཆོས་ཀྱི་རྒྱལ་མཚན་ནི་བསྒྲེང་། བག་ལ་ཉལ་རྣམས་ནི་བཏོན། ཆོས་ཀྱི་དེ་བཞིན་ཉིད་ནི་མཁྱེན། ཡང་དག་པའི་མཐའ་ནི་ཐུགས་སུ་ཆུད། ཆོས་ཀྱི་དབྱིངས་ནི་ཡོངས་སུ་མཁྱེན། སེམས་ཅན་གྱི་ཁམས་ནི་རྣམ་པར་བཀོད། ཡང་དག་པ་ཉིད་དུ་ངེས་པའི་ཕུང་པོ་ནི་བསྔགས། ལོག་པ་ཉིད་དུ་ངེས་པའི་ཕུང་པོ་ནི་སྨད། མ་ངེས་པའི་ཕུང་པོ་ནི་ཡོངས་སུ་བཟུང་། སེམས་ཅན་གྱི་དབང་པོ་རྣམས་ལ་ནི་རྣམ་པར་གཟིགས། སེམས་ཅན་གྱི་སྤྱོད་པ་ནི་ཡོངས་སུ་མཁྱེན།
en: Monks, when the Thus-Gone One reached complete awakening in this manner, a thick darkness was lifted, craving was purified, beliefs were eradicated, the afflictions were rattled, the splinter was removed, the knot was untied, the flag of pride was brought down, the flag of righteousness was lifted, latent formations were uprooted, the suchness of phenomena became known, the absolute was comprehended, the realm of phenomena was understood, the nature of sentient beings was ascertained, those oriented toward reality were approved of, those oriented toward mistakenness were disapproved of, the indeterminate were accepted, the faculties of sentient beings were seen in all their variety, the conduct of sentient beings was understood, the cure for the illnesses of sentient beings was comprehended, and the medicinal concoction of immortality was employed.

source: སེམས་ཅན་གྱི་ནད་གསོ་བ་ནི་ཐུགས་སུ་ཆུད། བདུད་རྩིའི་སྨན་སྦྱར་བ་ནི་གྲུབ། སྨན་པའི་རྒྱལ་པོར་ནི་བྱུང་། སྡུག་བསྔལ་ཐམས་ཅད་ལས་རབ་ཏུ་ཐར་བར་མཛད་པ་པོར་ནི་གྱུར། མྱ་ངན་ལས་འདས་པའི་བདེ་བ་ལ་འཇོག་པ་པོར་ནི་གྱུར།
en: He became the king of physicians, who would liberate beings from all suffering and establish them in the bliss of nirvāṇa;

source: དེ་བཞིན་གཤེགས་པའི་སྙིང་པོ། དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་རྒྱལ་པོའི་ཁྲི་ཆེན་པོ་ལ་ནི་བཞུགས།
en: he took his seat on the magnificent royal throne of the thus-gone ones, the essence of the thus-gone ones.

source: རྣམ་པར་གྲོལ་བའི་ཐབས་ནི་བརྙེས། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གྲོང་ཁྱེར་དུ་ནི་ཞུགས། སངས་རྒྱས་ཐམས་ཅད་དང་ཡང་དག་པར་ནི་འདྲེས། ཆོས་ཀྱི་དབྱིངས་ཐུགས་སུ་ཆུད་པ་ལས་དབྱེར་མེད་པར་ནི་གྱུར་ཏོ།
en: He discovered the means to complete liberation and entered the city of omniscience, where he mingled perfectly with all buddhas and became inseparable from the comprehension of the realm of phenomena.

source: །དགེ་སློང་དག་དེ་བཞིན་གཤེགས་པ་ངས་འདིར་ཐོག་མ་མེད་པའི་སྐྱེ་བ་དང་། རྒ་བ་དང་། འཆི་བའི་སྡུག་བསྔལ་མཐར་ཕྱུང་ངོ་ཞེས་ཞག་བདུན་པ་དང་པོ་ལ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་དེ་ཉིད་ན་བཞུགས་སོ།། །།
en: Monks, the Thus-Gone One abided on the seat of awakening for the first seven days, reflecting, “Here I have brought an end to the suffering of birth, old age, and death, which has been happening since time immemorial.”
